"""
Задание_8. Матрица 5x4 заполняется вводом с клавиатуры кроме последних элементов строк.
Программа должна вычислять сумму введенных элементов каждой строки
и записывать ее в последнюю ячейку строки.
В конце следует вывести полученную матрицу.

1-я строка:
3
3
3
3
2-я строка:
3
3
3
3
3-я строка:
3
3
3
3
4-я строка:
3
3
3
3
5-я строка:
3
3
3
3

[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
[3, 3, 3, 3, 12]
"""

MASS = []
for i in range(5):
    SUMM = 0
    L = []
    for j in range(4):
        ELEM = int(input(f"Введите элемент [{i}, {j}]: "))
        SUMM += ELEM
        L.append(ELEM)
    L.append(SUMM)
    MASS.append(L)

for i in MASS:
    print(i)



